app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-03-24 20:02:18.424501"], ["updated_at", "2019-03-24 20:02:18.424501"]]

  def update
    @class = SchoolClass.find(params[:id])
    @class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-03-24 20:20:47.394575"], ["id", 1]]